Revit 2024 API
PipePressureDropData.InsideDiameter Property
 The inside diameter of the pipe. Units: (ft).
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public double InsideDiameter { get; }
Visual Basic
Public ReadOnly Property InsideDiameter As Double
	Get
Visual C++
public:
property double InsideDiameter {
	double get ();
}
See Also
PipePressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace